MECAB_SETTING = "/etc/mecabrc"
MECAB_DICTIONARY = "/usr/lib/x86_64-linux-gnu/mecab/dic/mecab-ipadic-neologd"
MECAB_ARGS = " -r " + MECAB_SETTING + " -d " + MECAB_DICTIONARY

#表記ゆれ修正用辞書
notation_fluctuation1={"むり":"無理","ムリ":"無理","いう":"言う","わかる":"分かる"
                      ,"こと":"事","おもう":"思う","ひと":"人","だれか":"誰か"
                      ,"ヤバい":"やばい","駄目":"だめ","ダメ":"だめ","こまる":"困る"
                      ,"いや":"嫌","つらい":"辛い","きつい":"辛い","できる":"出来る"
                      ,"しんどい":"辛い","こわい":"怖い","マジ":"まじ","しぬ":"死ぬ"
                      ,"やめる":"辞める"}
notation_fluctuation2={"わからない":"分からない","わからん":"分からない","分からん":"分からない"
                       ,"わかりません":"分かりません","わかんない":"分からない","おしえて":"教えて"
                       ,"マジで":"まじ","できん":"出来ない","めんどい":"面倒","就活どう":"就活、どう"
                       ,"めんどくさい":"面倒","しんどい":"辛い","書けん":"書けない","ほんと":"本当"
                       ,"できない":"出来ない","かけない":"書けない","しなきゃ":"しないと","やだ":"嫌だ"
                      ,"ムズイ":"難しい","むずい":"難しい","きつい":"辛い","だるい":"面倒"
                      ,"ほんっと":"本当","やべえ":"やばい","ほんま":"本当","たすけて":"助けて","たすける":"助ける"
                      ,"...":"…","、、、":"…","・・・":"…"}